// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

function zad1() {
let number = Number(prompt("Введи число"));

if (number === 10) {
    alert('Вірно')
}
else {
    alert('Невірно')
}
    
}

zad1()


// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * 59);
function zad2() {
const min = Math.floor(Math.random() * 59);

if (min >= 0 && min <= 14) {
    console.log(`${min} У першій частині`)
}
else if (min >= 15 && min <= 30) {
    console.log(`${min} У другій частині`)
}
else if (min >= 31 && min <= 44) {
    console.log(`${min} У третій частині`)
    
}
else if (min >= 45 && min <= 59) {
    console.log(`${min} У четвертій частині`)
    
}

}


zad2()

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.


function zad3() {
    let quest = prompt("Подай число від 1 до 4")
switch (quest) {
    case '1':
        quest = 'зима'
        break;
    case '2':
        quest = 'весна'
        break;
    case '3':
        quest = 'літо'
        break;
    case '4':
        quest = 'осінь'
        break;
    default:
        quest = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
        break;
    }
    console.log(quest)

}

zad3()

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples


function zad4() {
    let time = prompt("Подай хвилини");

let hours = String(Math.floor(time / 60)).padStart(2, "0");
let minutes =String(Math.floor(time % 60)).padStart(2, "0")  ;

console.log(`${hours} : ${minutes}`)
}

zad4()

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

function zad5() {
  let login = prompt("Подай Логін")
console.log(login);


if (login === null || login === "") {
        alert("Скасовано");
}
else if (login === "Адмін") {
    let password = prompt("Подай пароль")
    
    if (password === null || password === "") {
        alert("Скасовано");
    }
    else if (password === 'Я головний') {
        alert('Добрий день!')
    }
    else {
        alert('Невірний пароль!')
        }
}
    
else
{
        alert('Я вас не знаю')
    }
      

}

zad5()

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.


function zad6() {
    let x = 0;
    
    while (x <= 20) {
        console.log(x)
        x++
    }

}


zad6()

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.


function zad7(min, max) {
    let suma = 0
    for (let i = max; i >= min; i--){
        suma += i
        console.log(i);
        
    }

    console.log("----------")
    console.log(suma)
    
}

zad7(1, 10)

// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.


function zad8(a, b) {
  
    if (a === Number(a) && b === Number(b)) {
        if (a > b) {
            return a
        }
        else {
            return b
        }
    }
    else {
        return 'Not a number!'
    }


}

console.log(zad8(2, 10))

// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// zad 9
function isAdult(age) {
    if (age >= 18) {
        return true
    }
    else {
     return confirm("Підтверди що відповідальність несеш за себе сам")
    
    }
}

console.log(isAdult(8))

// zad 10

// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.


function fizzBuzz(num) {
    for (let i = 1; i <= num; i++){
         if (i % 3 == 0 && i % 5 == 0) {
            console.log('fizzbuzz');
        }
        else if (i % 3 == 0) {
            console.log('fizz');
        }
        else if (i % 5 == 0) {
            console.log('buzz');
        }

    }

}


fizzBuzz(5);
